app/Controllers/barang.php

    public function index()
    {
        $data = [
            'active' => 'barang',
            'judul' => 'Master Data',
            'barang'=> $this->barang->findAll()
---
SELECT *
FROM `barang`

    public function store()
    {
        $data = $this->request->getPost();


        $this->barang->save($data);
---
INSERT INTO `barang` (`nama_barang`, `harga`, `stock`) VALUES ('sepeda', '500000', '50')