app/Controllers/customer.php

    public function index()
    {
        $data = [
            'active' => 'customer',
            'judul' => 'Master Data',
            'customer'=> $this->customer->findAll()
---
SELECT *
FROM `customer`

    public function store()
    {
        $data = $this->request->getPost();


        $this->customer->save($data);
---
INSERT INTO `customer` (`nama_customer`, `no_telp`, `email`) VALUES ('siska', '0947493839', 'siskaaaa')